{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "e51d7a69",
   "metadata": {},
   "source": [
    "## Import Libraries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "91f309a9",
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f7f7d822",
   "metadata": {},
   "source": [
    "## Load Data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "d0274e90",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Load config from file\n",
    "def load_neo4j_config(filepath):\n",
    "    config = {}\n",
    "    with open(filepath, 'r') as file:\n",
    "        for line in file:\n",
    "            if '=' in line:\n",
    "                key, value = line.strip().split('=', 1)\n",
    "                config[key] = value\n",
    "    return config"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "61524e54",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Load credentials from the file\n",
    "config = load_neo4j_config(\"../../Encryption/movie-config.txt\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "d9379f92",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Assign values\n",
    "uri = config.get(\"NEO4J_URI\")\n",
    "username = config.get(\"NEO4J_USERNAME\")\n",
    "password = config.get(\"NEO4J_PASSWORD\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "95ec8820",
   "metadata": {},
   "source": [
    "## Perform Queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "1e6ccb01",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Create driver\n",
    "driver = GraphDatabase.driver(uri, auth=(username, password))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f4384300",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Actor: François Lallement\n",
      "----------------------------------------\n",
      "Actor: Jules-Eugène Legris\n",
      "----------------------------------------\n",
      "Actor: Lillian Gish\n",
      "----------------------------------------\n",
      "Actor: Mae Marsh\n",
      "----------------------------------------\n",
      "Actor: Henry B. Walthall\n",
      "----------------------------------------\n",
      "Actor: Miriam Cooper\n",
      "----------------------------------------\n",
      "Actor: Dan Hanlon\n",
      "----------------------------------------\n",
      "Actor: Edna Pendleton\n",
      "----------------------------------------\n",
      "Actor: Curtis Benton\n",
      "----------------------------------------\n",
      "Actor: Allen Holubar\n",
      "----------------------------------------\n",
      "Actor: Spottiswoode Aitken\n",
      "----------------------------------------\n",
      "Actor: Mary Alden\n",
      "----------------------------------------\n",
      "Actor: Frank Bennett\n",
      "----------------------------------------\n",
      "Actor: Edna Purviance\n",
      "----------------------------------------\n",
      "Actor: Eric Campbell\n",
      "----------------------------------------\n",
      "Actor: Albert Austin\n",
      "----------------------------------------\n",
      "Actor: Harold Lloyd\n",
      "----------------------------------------\n",
      "Actor: 'Snub' Pollard\n",
      "----------------------------------------\n",
      "Actor: Bebe Daniels\n",
      "----------------------------------------\n",
      "Actor: Werner Krauss\n",
      "----------------------------------------\n",
      "Actor: Conrad Veidt\n",
      "----------------------------------------\n",
      "Actor: Friedrich Feher\n",
      "----------------------------------------\n",
      "Actor: Lil Dagover\n",
      "----------------------------------------\n",
      "Actor: Paul Wegener\n",
      "----------------------------------------\n",
      "Actor: Albert Steinrück\n",
      "----------------------------------------\n"
     ]
    }
   ],
   "source": [
    "with driver.session() as session:\n",
    "    result = session.run(\n",
    "        \"\"\"\n",
    "        MATCH (n:Actor) RETURN n LIMIT 25\n",
    "        \"\"\"\n",
    "    )\n",
    "\n",
    "    # Display the results\n",
    "    for record in result:\n",
    "        actor = record['n']\n",
    "        print(f\"Actor: {actor['name']}\")\n",
    "        print(\"-\" * 40)\n",
    "\n",
    "driver.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "f99a97d2",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "C:\\Users\\haoch\\AppData\\Local\\Temp\\ipykernel_31304\\3786384549.py:1: DeprecationWarning: Using a driver after it has been closed is deprecated. Future versions of the driver will raise an error.\n",
      "  with driver.session() as session:\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Movie: Punchline\n",
      "Languages: ['English']\n",
      "Language: English\n",
      "----------------------------------------\n",
      "Movie: Catch Me If You Can\n",
      "Languages: ['English', ' French']\n",
      "Language: English\n",
      "----------------------------------------\n",
      "Movie: Catch Me If You Can\n",
      "Languages: ['English', ' French']\n",
      "Language:  French\n",
      "----------------------------------------\n",
      "Movie: Dragnet\n",
      "Languages: ['English']\n",
      "Language: English\n",
      "----------------------------------------\n",
      "Movie: Saving Mr. Banks\n",
      "Languages: ['English']\n",
      "Language: English\n",
      "----------------------------------------\n",
      "Movie: Bachelor Party\n",
      "Languages: ['English', ' Japanese']\n",
      "Language: English\n",
      "----------------------------------------\n",
      "Movie: Bachelor Party\n",
      "Languages: ['English', ' Japanese']\n",
      "Language:  Japanese\n",
      "----------------------------------------\n",
      "Movie: Volunteers\n",
      "Languages: ['English']\n",
      "Language: English\n",
      "----------------------------------------\n",
      "Movie: Man with One Red Shoe, The\n",
      "Languages: ['English']\n",
      "Language: English\n",
      "----------------------------------------\n",
      "Movie: Splash\n",
      "Languages: ['English', ' Swedish']\n",
      "Language: English\n",
      "----------------------------------------\n",
      "Movie: Splash\n",
      "Languages: ['English', ' Swedish']\n",
      "Language:  Swedish\n",
      "----------------------------------------\n",
      "Movie: Big\n",
      "Languages: ['English']\n",
      "Language: English\n",
      "----------------------------------------\n",
      "Movie: Nothing in Common\n",
      "Languages: ['English']\n",
      "Language: English\n",
      "----------------------------------------\n",
      "Movie: Money Pit, The\n",
      "Languages: ['English', ' Spanish', ' Chinese']\n",
      "Language: English\n",
      "----------------------------------------\n",
      "Movie: Money Pit, The\n",
      "Languages: ['English', ' Spanish', ' Chinese']\n",
      "Language:  Spanish\n",
      "----------------------------------------\n",
      "Movie: Money Pit, The\n",
      "Languages: ['English', ' Spanish', ' Chinese']\n",
      "Language:  Chinese\n",
      "----------------------------------------\n",
      "Movie: Toy Story of Terror\n",
      "Languages: ['English']\n",
      "Language: English\n",
      "----------------------------------------\n",
      "Movie: Captain Phillips\n",
      "Languages: ['English', ' Somali']\n",
      "Language: English\n",
      "----------------------------------------\n",
      "Movie: Captain Phillips\n",
      "Languages: ['English', ' Somali']\n",
      "Language:  Somali\n",
      "----------------------------------------\n",
      "Movie: Larry Crowne\n",
      "Languages: ['English']\n",
      "Language: English\n",
      "----------------------------------------\n",
      "Movie: Cloud Atlas\n",
      "Languages: ['English', ' Spanish']\n",
      "Language: English\n",
      "----------------------------------------\n",
      "Movie: Cloud Atlas\n",
      "Languages: ['English', ' Spanish']\n",
      "Language:  Spanish\n",
      "----------------------------------------\n",
      "Movie: Angels & Demons\n",
      "Languages: ['English', ' Italian', ' Latin', ' French', ' Swiss German', ' German', ' Chinese']\n",
      "Language: English\n",
      "----------------------------------------\n",
      "Movie: Angels & Demons\n",
      "Languages: ['English', ' Italian', ' Latin', ' French', ' Swiss German', ' German', ' Chinese']\n",
      "Language:  Italian\n",
      "----------------------------------------\n",
      "Movie: Angels & Demons\n",
      "Languages: ['English', ' Italian', ' Latin', ' French', ' Swiss German', ' German', ' Chinese']\n",
      "Language:  Latin\n",
      "----------------------------------------\n",
      "Movie: Angels & Demons\n",
      "Languages: ['English', ' Italian', ' Latin', ' French', ' Swiss German', ' German', ' Chinese']\n",
      "Language:  French\n",
      "----------------------------------------\n",
      "Movie: Angels & Demons\n",
      "Languages: ['English', ' Italian', ' Latin', ' French', ' Swiss German', ' German', ' Chinese']\n",
      "Language:  Swiss German\n",
      "----------------------------------------\n",
      "Movie: Angels & Demons\n",
      "Languages: ['English', ' Italian', ' Latin', ' French', ' Swiss German', ' German', ' Chinese']\n",
      "Language:  German\n",
      "----------------------------------------\n",
      "Movie: Angels & Demons\n",
      "Languages: ['English', ' Italian', ' Latin', ' French', ' Swiss German', ' German', ' Chinese']\n",
      "Language:  Chinese\n",
      "----------------------------------------\n",
      "Movie: Extremely Loud and Incredibly Close\n",
      "Languages: ['English']\n",
      "Language: English\n",
      "----------------------------------------\n",
      "Movie: Charlie Wilson's War\n",
      "Languages: ['English', ' Dari', ' Russian', ' Urdu', ' Hebrew', ' Arabic']\n",
      "Language: English\n",
      "----------------------------------------\n",
      "Movie: Charlie Wilson's War\n",
      "Languages: ['English', ' Dari', ' Russian', ' Urdu', ' Hebrew', ' Arabic']\n",
      "Language:  Dari\n",
      "----------------------------------------\n",
      "Movie: Charlie Wilson's War\n",
      "Languages: ['English', ' Dari', ' Russian', ' Urdu', ' Hebrew', ' Arabic']\n",
      "Language:  Russian\n",
      "----------------------------------------\n",
      "Movie: Charlie Wilson's War\n",
      "Languages: ['English', ' Dari', ' Russian', ' Urdu', ' Hebrew', ' Arabic']\n",
      "Language:  Urdu\n",
      "----------------------------------------\n",
      "Movie: Charlie Wilson's War\n",
      "Languages: ['English', ' Dari', ' Russian', ' Urdu', ' Hebrew', ' Arabic']\n",
      "Language:  Hebrew\n",
      "----------------------------------------\n",
      "Movie: Charlie Wilson's War\n",
      "Languages: ['English', ' Dari', ' Russian', ' Urdu', ' Hebrew', ' Arabic']\n",
      "Language:  Arabic\n",
      "----------------------------------------\n",
      "Movie: Toy Story 3\n",
      "Languages: ['English', ' Spanish']\n",
      "Language: English\n",
      "----------------------------------------\n",
      "Movie: Toy Story 3\n",
      "Languages: ['English', ' Spanish']\n",
      "Language:  Spanish\n",
      "----------------------------------------\n",
      "Movie: From the Earth to the Moon\n",
      "Languages: ['English']\n",
      "Language: English\n",
      "----------------------------------------\n",
      "Movie: Green Mile, The\n",
      "Languages: ['English', ' French']\n",
      "Language: English\n",
      "----------------------------------------\n",
      "Movie: Green Mile, The\n",
      "Languages: ['English', ' French']\n",
      "Language:  French\n",
      "----------------------------------------\n",
      "Movie: Saving Private Ryan\n",
      "Languages: ['English', ' French', ' German', ' Czech']\n",
      "Language: English\n",
      "----------------------------------------\n",
      "Movie: Saving Private Ryan\n",
      "Languages: ['English', ' French', ' German', ' Czech']\n",
      "Language:  French\n",
      "----------------------------------------\n",
      "Movie: Saving Private Ryan\n",
      "Languages: ['English', ' French', ' German', ' Czech']\n",
      "Language:  German\n",
      "----------------------------------------\n",
      "Movie: Saving Private Ryan\n",
      "Languages: ['English', ' French', ' German', ' Czech']\n",
      "Language:  Czech\n",
      "----------------------------------------\n",
      "Movie: Toy Story 2\n",
      "Languages: ['English', ' Arabic', ' Spanish']\n",
      "Language: English\n",
      "----------------------------------------\n",
      "Movie: Toy Story 2\n",
      "Languages: ['English', ' Arabic', ' Spanish']\n",
      "Language:  Arabic\n",
      "----------------------------------------\n",
      "Movie: Toy Story 2\n",
      "Languages: ['English', ' Arabic', ' Spanish']\n",
      "Language:  Spanish\n",
      "----------------------------------------\n",
      "Movie: Apollo 13\n",
      "Languages: ['English']\n",
      "Language: English\n",
      "----------------------------------------\n",
      "Movie: Toy Story\n",
      "Languages: ['English']\n",
      "Language: English\n",
      "----------------------------------------\n",
      "Movie: League of Their Own, A\n",
      "Languages: ['English']\n",
      "Language: English\n",
      "----------------------------------------\n",
      "Movie: Forrest Gump\n",
      "Languages: ['English']\n",
      "Language: English\n",
      "----------------------------------------\n",
      "Movie: Philadelphia\n",
      "Languages: ['English']\n",
      "Language: English\n",
      "----------------------------------------\n",
      "Movie: Sleepless in Seattle\n",
      "Languages: ['English']\n",
      "Language: English\n",
      "----------------------------------------\n",
      "Movie: Turner & Hooch\n",
      "Languages: ['English']\n",
      "Language: English\n",
      "----------------------------------------\n",
      "Movie: 'burbs, The\n",
      "Languages: ['English']\n",
      "Language: English\n",
      "----------------------------------------\n",
      "Movie: Joe Versus the Volcano\n",
      "Languages: ['English']\n",
      "Language: English\n",
      "----------------------------------------\n",
      "Movie: Bonfire of the Vanities\n",
      "Languages: ['English']\n",
      "Language: English\n",
      "----------------------------------------\n",
      "Movie: Terminal, The\n",
      "Languages: ['English', ' French', ' Russian', ' Bulgarian', ' Spanish']\n",
      "Language: English\n",
      "----------------------------------------\n",
      "Movie: Terminal, The\n",
      "Languages: ['English', ' French', ' Russian', ' Bulgarian', ' Spanish']\n",
      "Language:  French\n",
      "----------------------------------------\n",
      "Movie: Terminal, The\n",
      "Languages: ['English', ' French', ' Russian', ' Bulgarian', ' Spanish']\n",
      "Language:  Russian\n",
      "----------------------------------------\n",
      "Movie: Terminal, The\n",
      "Languages: ['English', ' French', ' Russian', ' Bulgarian', ' Spanish']\n",
      "Language:  Bulgarian\n",
      "----------------------------------------\n",
      "Movie: Terminal, The\n",
      "Languages: ['English', ' French', ' Russian', ' Bulgarian', ' Spanish']\n",
      "Language:  Spanish\n",
      "----------------------------------------\n",
      "Movie: Da Vinci Code, The\n",
      "Languages: ['English', ' French', ' Latin', ' Spanish']\n",
      "Language: English\n",
      "----------------------------------------\n",
      "Movie: Da Vinci Code, The\n",
      "Languages: ['English', ' French', ' Latin', ' Spanish']\n",
      "Language:  French\n",
      "----------------------------------------\n",
      "Movie: Da Vinci Code, The\n",
      "Languages: ['English', ' French', ' Latin', ' Spanish']\n",
      "Language:  Latin\n",
      "----------------------------------------\n",
      "Movie: Da Vinci Code, The\n",
      "Languages: ['English', ' French', ' Latin', ' Spanish']\n",
      "Language:  Spanish\n",
      "----------------------------------------\n",
      "Movie: Polar Express, The\n",
      "Languages: ['English']\n",
      "Language: English\n",
      "----------------------------------------\n",
      "Movie: Ladykillers, The\n",
      "Languages: ['English', ' Vietnamese']\n",
      "Language: English\n",
      "----------------------------------------\n",
      "Movie: Ladykillers, The\n",
      "Languages: ['English', ' Vietnamese']\n",
      "Language:  Vietnamese\n",
      "----------------------------------------\n",
      "Movie: You've Got Mail\n",
      "Languages: ['English']\n",
      "Language: English\n",
      "----------------------------------------\n"
     ]
    }
   ],
   "source": [
    "with driver.session() as session:\n",
    "    result = session.run(\n",
    "        \"\"\"\n",
    "        MATCH (m:Movie)-[:ACTED_IN]-(a:Actor)\n",
    "        WHERE a.name = 'Tom Hanks'\n",
    "        UNWIND m.languages AS lang\n",
    "        RETURN m.title AS movie,\n",
    "               m.languages AS languages,\n",
    "               lang AS language\n",
    "        \"\"\"\n",
    "    )\n",
    "\n",
    "    # Display the results\n",
    "    for record in result:\n",
    "        print(f\"Movie: {record['movie']}\")\n",
    "        print(f\"Languages: {record['languages']}\")\n",
    "        print(f\"Language: {record['language']}\")\n",
    "        print(\"-\" * 40)\n",
    "\n",
    "driver.close()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
